{
  "name": "Enieber Cunha da Silva",
  "username": "enieber",
  "description": " Software Engineer | React | React Native | Nextjs | Java | Kotlin | Android Developer | Front End | PHP | Full Stack | Developer with experiences with develop mobile, frontend, backend and create tools to help peoples.",
  "contents": [
    {
      "name": "Blog in PT-BR",
      "link": "https://olha-oque-fiz.vercel.app/"
    },
    {
      "name": "Youtube videos",
      "link": "https://www.youtube.com/user/eniebercunha"
    },
    {
      "name": "Github page",
      "link": "https://github.com/enieber"
    },    
    {
      "name": "Linkedin",
      "link": "https://linkedin.com/in/enieber/"
    },
    {
      "name": "Talks",
      "link": "https://slides.com/enieber"
    }
  ],
  "skills": [
    "js",
    "java",
    "typescript",
    "kotlin",
    "php",
    "wordpress",
    "shopify",
    "react",
    "react-native",
    "nextjs",
    "cypress",
    "docker",
    "docker-compose",
    "nginx",
    "nodejs",
    "linux",
    "angularjs",
    "heroku",
    "github",
    "gitlab",
    "aws",
    "rust",
    "vuejs",
    "nextcloud"
  ],
  "experiences": [
    {
      "title": "Software Engineer - LibreCode",
      "start": "03/2023",
      "description": "Develop solution to software LibreSign, mantainer services running in Nextcloud.Develop solution to software LibreSign, mantainer services running in Nextcloud.",
      "skills": ["nextcloud", "vuejs", "php", "github"]
    },
    {
      "title": "Frontend Developer - Cognizant",
      "start": "01/2022",
      "end": "03/2023",
      "skills": ["cypress", "react", "cloud", "github"],
      "description": "Developer frontend aplication with rules of crop science in pharmaceutical company. Using typescript to create microfronends in react connected in Rest api and deployed in Azure cloud."
    },
    {
      "title": "Backend Developer - Cognizant",
      "start": "01/2021",
      "end": "01/2022",
      "skills": ["cypress", "nodejs", "docker", "docker-compose"],
      "description": "Developer aplication to bot framework to response in Whatsapp chat in telcom company. Using typescript to develop modules with unit test, and e2e test. I started created e2e test automatication using cypress and after I helper the QA of team automate and save in pdf evidencies of e2e test. I developed a cli to help develop and integrate sistems to run using docker-compose in develop evironment."
    },
    {
      "title": "Android Developer - Cognizant",
      "start": "05/2020",
      "end": "11/2020",
      "skills": ["android", "kotlin", "gitlab"],
      "description": "Developer aplication mobile to android plataform using kotlin in bank company. In this project I self-age responsibility to mantainer and develop new features to app using modules android, unit test and acessibility test. The develop need pass to security test and CI/CD pipeline."
    },
    {
      "title": "Mobile  Developer - StartSe",
      "start": "09/2019",
      "skills": ["android", "react", "react-native", "aws", "mongodb", "nodejs", "graphql"],
      "end": "02/2020",
      "description": "Development of a web application that gathers all user data in one place, made in reatjs and authenticated by another application using OAuth. An API made on nodes was also used to capture the data of the logged user. Register and develop an application that allows or uses all products offered by StartSe. Follow courses, events, and missions acquired by the user. Joining an Alumni community ends a mission. Follow news posted on the StartSe platform. This application was developed in react-native using notifications with OneSignal for notifications, to obtain interaction flows in real-time and connected with an API node."
    },
    {
      "title": "Lead  Client  App  Developer - EuSouElliot",
      "start": "01/2019",
      "skills": ["react", "react-native", "nodejs"],
      "end": "09/2019",
      "description": "Development of an initial structure for the creation of the PWA version of the app, to track the transactions made by the app and to monitor the price variation of cryptocurrencies.  This project was done using Reactjs and styled components. Improvement and development of the application, where it was possible to make a purchase and sale of cryptocurrencies, in addition to monitoring your purchases it was possible to view news related to cryptocurrencies. This app used react-native, styled-component and connected to an Rest API."
    },
    {
      "title": "Mobile  Software  Developer - Multiware  Tecnologia",
      "start": "08/2016",
      "skills": ["android", "kotlin", "java", "php"],
      "end": "01/2019",
      "description": "Initially among the company to improve the Android application, which uses the connection to a specific server for each group of users, it is possible to manage applications, view and renew slips for customers, manage feasibility, manage customer data and view metrics to execute decisions. This application was started in java and was activated again in native mode for use on iOS. It was controlled by redux actions, both the logical part like saving a new ticket in the offline case database and later synchronized  and  the  screen  navigation  part  like  logged in  and  moved. Help  the  team  and  others  to  develop  through  PHP  quick courses,  js  and other  skills. The idea and development of a new product to facilitate the customer of the providers reached by TopSapp to open and monitor a case called problems with services provided by the proven company also facilitates access to the financial part of the payment of debts. This application was made in a native version and was re-approved as a basis to recreate an application for each version when the number of applications published on Google  Play  and  Playstore  was  over  30."
    },
    {
      "title": "Front  End  Developer - JMJ Sistemas  e  Consultoria",
      "start": "01/2016",
      "skills": ["angularjs", "java"],
      "end": " 03/2016",
      "description": "I joined the company to assist in the development of a web product that scanned the attendance of Unimed plans. In the project there was a Rest API in java and the entire front-end was in angular 1.5."
    },
    {
      "title": "Front  End  Developer - MBoss Tecnologia",
      "start": "04/2015",
      "skills": ["android", "java", "design"],
      "end":"01/2016",
      "description": "As a first job in the development software area, I started as a front end developer to create the web part of the ERP made for desktop. Angular 1.5 was used to create the directives and it was for the front end to connect with an API written in Java. After a few months, I started working on the android application where it was possible to track an order and place new orders online or offline. The app was written in java and used libs as a retrofit to connect to the API in Java and SQLite was also used to save data offline."
    }
  ],
  "freelances": [
    {
      "title": "Contrate Telecon Plan",
      "skills": ["nextjs", "heroku"],
      "description": "In this project I created an list of plans to select and started contract services of telecon. In this project is possible list plans of company, select the plans, enter with user data and select location to vialbility or not to installation of service selected. This project is build with nextjs, google api, zip api and context api to manage states."
    },
    {
      "title": "Add In-App Purchase",
      "skills": ["andro", "react-native"],
      "description": "This project was need add premium content to version the app. The app has created in react-native and my responsability was add purchase in app and make upload to google play store."
    },
    {
      "title": "Custon plugin store in Shopify",
      "skills": ["shopify", "github"],
      "description": "This project was necessary change plugin and fix some bugs the plugin js in store. The store was created using Shopify builder and some plugins and my responsability was create and mantainer some features in store using js and jquery. This project was contracted of agencie of Australian."
    },
    {
      "title": "Connect Wordpress page with custon CRM",
      "skills": ["php", "wordpress", "js"],
      "description": "This project was necessary add call to CRM when download file and visite pages site. This project used custon plugins in wordpress in php and js."
    },
    {
      "title": "Teacher js",
      "skills": ["js"],
      "description": "I was teacher js using store in shopify and react-native app."
    },
    {
      "title": "Create course of Started in software develop",
      "skills": ["js", "html", "css"],
      "description": "I created the course of initiate in software development with games to young."
    },
    {
      "title": "Create course the PHP the rigth way",
      "skills": ["php"],
      "description": "I created course to explain how to programing php with good practice."
    }
  ],
  "formations": [
    {
      "locale": "Federal Institute of Education, Science and Technology by Mato Grosso",
      "title": "Degree Name Computer Technician Field Of Study Software Developer",
      "periodic": "2012 - 2015",
      "description": "Activities and Societies: I learned a lot about informatics in general. I developed a project at the end of the ﬁrst year of the course to unite all the codes created throughout the year. I participated in Latinoware 2014 and had contact with the world of open source development. At the end of the course we made an institutional website for the computer course and a monograph. The site was developed in Joomla and deployed in a free hosting service. \n I developed some educational and scientiﬁc research projects. Like teaching music using violin and viola. An electronic waste recycling project and I wrote a java code to read barcode."
    }
  ]
}
